app/Http/Controllers/Auth/AuthenticatedSessionController.php

    public function store(LoginRequest $request)
    {
        $checkUser = User::where('email', '=', $request->email)->where('type', '!=', 'admin')->first();
        if ($checkUser) {
            $currentWorkspace = UserWorkspace::where('workspace_id', '=', $checkUser->currant_workspace)->where('user_id', $checkUser->id)->first();
---
select * from `users` where `email` = 'tecnico@alsina.com' and `type` != 'admin' limit 1
select * from `user_workspaces` where `workspace_id` = 40 and `user_id` = 56 limit 1

        $json = json_encode($query);
        $user = \Auth::user();
        $totalWS = $user->countWorkspace();
        $permission = UserWorkspace::where('user_id', '=', $user->id)->where('permission', '=', 'Member')->count();
---
select count(*) as aggregate from `user_workspaces` where `user_id` = 56 and `permission` = 'Member'