app/Http/Controllers/Auth/RegisteredUserController.php

select * from `workspaces`
---
    public function showRegistrationForm($lang = '')
    {
        $setting = Utility::getAdminPaymentSettings();
        if ($lang == '') {
            $lang = app()->getLocale();
        }

        $langList = Utility::langList();
        $lang = array_key_exists($lang, $langList) ? $lang : 'en';
        if (empty($lang)) {
            $lang = Utility::getValByName('default_language');
        }

        App()->setLocale($lang);
        $workspaces = Workspace::all();