app/Http/Controllers/ClientController.php

select `clients`.*, `client_workspaces`.`is_active` from `clients` inner join `client_workspaces` on `client_workspaces`.`client_id` = `clients`.`id` where `client_workspaces`.`workspace_id` = 4
select `users`.*, `user_workspaces`.`permission`, `user_workspaces`.`is_active` from `users` inner join `user_workspaces` on `user_workspaces`.`user_id` = `users`.`id` where `user_workspaces`.`workspace_id` = 40 and `type` = 'user'
---
    public function index($slug = '')
    {
        $this->middleware('auth');
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);

        if ($currentWorkspace) {

            $clients = User::select('users.*', 'user_workspaces.permission', 'user_workspaces.is_active')
                ->join('user_workspaces', 'user_workspaces.user_id', '=', 'users.id');
            $clients->where('user_workspaces.workspace_id', '=', $currentWorkspace->id);
            $clients->where('type', 'client');
            $clients = $clients->get();