app/Http/Controllers/HomeController.php

select distinct `users`.* from `users` inner join `user_workspaces` on `user_workspaces`.`user_id` = `users`.`id` where `user_workspaces`.`permission` = 'Owner'
select * from `stages` where `workspace_id` = 4 and `complete` = '1' limit 1
---
    public function index($slug = '')
    {
        $userObj = Auth::user();
        if ($userObj->type == 'admin') {
            $users = User::select('users.*')->join('user_workspaces', 'user_workspaces.user_id', '=', 'users.id')
                ->where('user_workspaces.permission', '=', 'Owner')->distinct()->get();
            return view('users.index', compact('users'));
        }

        $currentWorkspace = Utility::getWorkspaceBySlug($slug);
        if ($currentWorkspace) {
            $doneStage = Stage::where('workspace_id', '=', $currentWorkspace->id)->where('complete', '=', '1')->first();

select count(*) as aggregate from `user_projects` inner join `tasks` on `tasks`.`project_id` = `user_projects`.`project_id` inner join `projects` on `projects`.`id` = `user_projects`.`project_id` where `user_id` = 4 and `projects`.`workspace` = 4
---
                    ->where('projects.workspace', '=', $currentWorkspace->id)
                    ->where('bug_reports.assign_to', '=', $userObj->id)->count();

                $totalTask = UserProject::join("tasks", "tasks.project_id", "=", "user_projects.project_id")
                    ->join("projects", "projects.id", "=", "user_projects.project_id")
                    ->where("user_id", "=", $userObj->id)->where('projects.workspace', '=', $currentWorkspace->id)
                    ->whereRaw("find_in_set('" . $userObj->id . "',tasks.assign_to)")->count();

select distinct `users`.`name`, `users`.`id` from `tasks` inner join `user_projects` on `tasks`.`project_id` = `user_projects`.`project_id` inner join `projects` on `projects`.`id` = `user_projects`.`project_id` inner join `stages` on `stages`.`id` = `tasks`.`status` inner join `users` on `users`.`id` = CAST(SUBSTRING_INDEX(tasks.assign_to, ',', 1) AS SIGNED) or `users`.`id` = CAST(SUBSTRING_INDEX(SUBSTRING_INDEX(tasks.assign_to, ',', -2), ',', 1) AS SIGNED) or `users`.`id` = CAST(SUBSTRING_INDEX(SUBSTRING_INDEX(tasks.assign_to, ',', -1), ',', 1) AS SIGNED) where `user_id` = 4 and `projects`.`workspace` = 4 order by `tasks`.`id` desc limit 5
---
            $tasksUsers = Task::orderBy('tasks.id', 'desc')
                ->join("user_projects", "tasks.project_id", "=", "user_projects.project_id")
                ->join("projects", "projects.id", "=", "user_projects.project_id")
                // ->join("stages", "stages.id", "=", "tasks.status")
                ->join("users", function ($join) {
                    $join->on("users.id", "=", DB::raw("CAST(SUBSTRING_INDEX(tasks.assign_to, ',', 1) AS SIGNED)"))
                        ->orWhere("users.id", "=", DB::raw("CAST(SUBSTRING_INDEX(SUBSTRING_INDEX(tasks.assign_to, ',', -2), ',', 1) AS SIGNED)"))
                        ->orWhere("users.id", "=", DB::raw("CAST(SUBSTRING_INDEX(SUBSTRING_INDEX(tasks.assign_to, ',', -1), ',', 1) AS SIGNED)"));
                })
                ->where("user_id", "=", $userObj->id)
                ->where('projects.workspace', '=', $currentWorkspace->id)
                ->limit(5)
                ->select(['users.name', 'users.id'])
                ->distinct()
                ->get()
                ->pluck('name', 'id')
                ->toArray();