app/Http/Controllers/ProjectController.php

select * from `projects` where `id` = '18' limit 1
---
    public function invite(Request $request, $slug, $projectID)
    {
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);
        $post = $request->all();
        $userList = $post['users_list'];

        $objProject = Project::find($projectID);

select `users`.* from `users` inner join `user_workspaces` on `user_workspaces`.`user_id` = `users`.`id` where `user_workspaces`.`workspace_id` = 40
select `projects`.* from `projects` inner join `user_projects` on `projects`.`id` = `user_projects`.`project_id` where `user_projects`.`user_id` = 4 and `projects`.`workspace` = 4
select `users`.* from `users` inner join `user_workspaces` on `user_workspaces`.`user_id` = `users`.`id` where `user_workspaces`.`workspace_id` = 4
---
    public function myMilestoneBoard()
    {
        $objUser = Auth::user();

        // Obtener el workspace actual del usuario
        $currentWorkspace = Utility::getWorkspaceBySlug($objUser->currentWorkspace->slug) ?? $objUser->currentWorkspace;

        $stages = Stage::orderBy('order')->get();

        $statusClass = $stages->map(function ($stage) {
            return 'milestone-list-' . str_replace(' ', '_', $stage->id);
        })->toArray();

        // 🔹 Milestones del usuario actual de TODOS los workspaces
        $allmilestones = Milestone::where(function ($q) use ($objUser) {
            $q->where('assign_to', $objUser->id)
                ->orWhere('milestone_assigned_to_user', $objUser->id)
                ->orWhere('created_by', $objUser->id)
                ->orWhereHas('tasks', function ($q2) use ($objUser) {
                    $q2->where('assign_to', $objUser->id);
                });
        })
            ->with([
                'tasks:id,milestone_id,assign_to',
                'project:id,workspace,name,type',
                'project.workspaceData:id,slug,name',
            ])

select * from `tasks` where `tasks`.`id` = '14' limit 1
---
    public function milestoneReviewSubmit(Request $request, $slug, $id)
    {
        try {
            $milestoneId = $request->input('milestone_id', $id);

            if (!$milestoneId || !is_numeric($milestoneId)) {
                return redirect()->back()->with('error', 'Falta el ID del milestone.');
            }

            $milestone = Milestone::with('tasks')->find($milestoneId);