app/Http/Controllers/ProjectController.php

    public function index($slug)
    {
        $objUser = Auth::user();
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);
        if ($objUser->getGuard() == 'client') {
            $projects = Project::select('projects.*')->join('client_projects', 'projects.id', '=', 'client_projects.project_id')->where('client_projects.client_id', '=', $objUser->id)->where('projects.workspace', '=', $currentWorkspace->id)->get();
        } else {
            $projects = Project::select('projects.*')->join('user_projects', 'projects.id', '=', 'user_projects.project_id')->where('user_projects.user_id', '=', $objUser->id)->where('projects.workspace', '=', $currentWorkspace->id)->get();
---
select `projects`.* from `projects` inner join `user_projects` on `projects`.`id` = `user_projects`.`project_id` where `user_projects`.`user_id` = 56 and `projects`.`workspace` = 40

    public function store($slug, Request $request)
    {
        $objUser = Auth::user();
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);
        $user = $currentWorkspace->id;
        $request->validate(['name' => 'required']);
        $setting = Utility::getAdminPaymentSettings();
        $post = $request->all();

        $post['start_date'] = $post['end_date'] = date('Y-m-d');
        $post['workspace'] = $currentWorkspace->id;
        $post['created_by'] = $objUser->id;

        $user_list = User::all();
        if (isset($user_list)) {

            //obtener todos los usuarios para que al crear un projecto todos puedan verlo
        }
        $userList[] = $objUser->email;
        $userList = array_filter($userList);
        $objProject = Project::create($post);
---
insert into `projects` (`ref_mo`, `name`, `end_date`, `start_date`, `workspace`, `created_by`, `updated_at`, `created_at`) values ('250006246', 'Obra Deta Carcel Sevilla 1', '2024-04-19', '2024-04-19', 9, 1, '2024-04-19 10:59:51', '2024-04-19 10:59:51')

        $data['task']  = 'on';
        $data['password_protected']  = 'off';
        $objProject->copylinksetting =  json_encode($data);
        $objProject->save();

        foreach ($userList as $email) {
            $permission = 'Member';
            $registerUsers = User::where('email', $email)->first();
---
update `projects` set `copylinksetting` = '{\"basic_details\":\"on\",\"member\":\"on\",\"client\":\"on\",\"attachment\":\"on\",\"bug_report\":\"on\",\"task\":\"on\",\"password_protected\":\"off\"}', `projects`.`updated_at` = '2024-04-19 10:59:51' where `id` = 41
select * from `users` where `email` = 'admin@alsina.com' limit 1

    public function inviteUser(User $user, Project $project, $permission)
    {
        $authuser = Auth::user();
        $authusername  = User::where('id', '=', $authuser->id)->first();
---
select * from `users` where `id` = 1 limit 1

        $arrData = [];
        $arrData['user_id'] = $user->id;
        $arrData['project_id'] = $project->id;
        $is_invited = UserProject::where($arrData)->first();
        if (!$is_invited) {
            $arrData['permission'] = json_encode(Utility::getAllPermission());
            UserProject::create($arrData);
---
select * from `user_projects` where (`user_id` = 1 and `project_id` = 41) limit 1
insert into `user_projects` (`user_id`, `project_id`, `permission`, `updated_at`, `created_at`) values (1, 41, '[\"create milestone\",\"edit milestone\",\"delete milestone\",\"show milestone\",\"create task\",\"edit task\",\"delete task\",\"show task\",\"move task\",\"show activity\",\"show uploading\",\"show timesheet\",\"show bug report\",\"create bug report\",\"edit bug report\",\"delete bug report\",\"move bug report\",\"show gantt\"]', '2024-04-19 10:59:51', '2024-04-19 10:59:51')

    public function show($slug, $projectID)
    {
        $objUser = Auth::user();
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);
        if ($objUser && $currentWorkspace) {
            //===============MODIFICADO =============//
            if ($objUser->getGuard() == 'client') {
                $project = Project::select('projects.*')->join('client_projects', 'projects.id', '=', 'client_projects.project_id')
                    // ->where('client_projects.client_id', '=', $objUser->id)
                    ->where('projects.workspace', '=', $currentWorkspace->id)
                    ->where('projects.id', '=', $projectID)->with('activities.user')->first();
            } else {
                $project = Project::select('projects.*')->join('user_projects', 'projects.id', '=', 'user_projects.project_id')
                    // ->where('user_projects.user_id', '=', $objUser->id)
                    ->where('projects.workspace', '=', $currentWorkspace->id)
                    ->where('projects.id', '=', $projectID)->with('activities.user')->first();
---
select * from `users` where `users`.`id` in (22)
select `projects`.* from `projects` inner join `user_projects` on `projects`.`id` = `user_projects`.`project_id` where `user_projects`.`user_id` = 22 and `projects`.`workspace` = 20 and `projects`.`id` = '5' limit 1
select * from `users` where `users`.`id` in (58)

    public function getProjectChart($arrParam)
    {
        $workspaceId = $arrParam['workspace_id'];
        $projectId = $arrParam['project_id'] ?? null;
        $duration = $arrParam['duration'] ?? null;

        // Initialize the array to store task counts for each stage
        $taskCounts = [];

        // Determine the date range based on the duration
        if ($duration === 'week') {
            $previousWeek = Utility::getFirstSeventhWeekDay(-1);


            foreach ($previousWeek['datePeriod'] as $dateObject) {
                $date = $dateObject->format('Y-m-d');
                $dayName = $dateObject->format('D');
                $taskCounts[$dayName] = Stage::getTaskCountsForDate($workspaceId, $projectId, $date);
            }
        }

        // Get stage names and colors
        $stages = Stage::where('workspace_id', $workspaceId)->orderBy('order')->get();
---
select * from `stages` where `workspace_id` = 45 order by `order` asc

    public function update(Request $request, $slug, $projectID)
    {
        $request->validate(
            [
                'name' => 'required',
            ]
        );
        $objUser = Auth::user();
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);
        $project = Project::select('projects.*')->join('user_projects', 'projects.id', '=', 'user_projects.project_id')
            ->where('user_projects.user_id', '=', $objUser->id)
            ->where('projects.workspace', '=', $currentWorkspace->id)
            ->where('projects.id', '=', $projectID)->first();
        $project->update($request->all());

        return redirect()->back()->with('success', __('Project Updated Successfully!'));
---
select `projects`.* from `projects` inner join `user_projects` on `projects`.`id` = `user_projects`.`project_id` where `projects`.`workspace` = 40 and `projects`.`id` = '18' limit 1

    public function taskBoard($slug, $projectID)
    {
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);

        $objUser = Auth::user();

        if ($objUser && $currentWorkspace) {

            if ($objUser->getGuard() == 'client') {
                $project = Project::select('projects.*')->join('user_projects', 'projects.id', '=', 'user_projects.project_id')->where('projects.workspace', '=', $currentWorkspace->id)->where('projects.id', '=', $projectID)->first();
            } else {
                $project = Project::select('projects.*')->join('user_projects', 'projects.id', '=', 'user_projects.project_id')->where('user_projects.user_id', '=', $objUser->id)->where('projects.workspace', '=', $currentWorkspace->id)->where('projects.id', '=', $projectID)->first();
            }

            if ($project) {
                $stages = $statusClass = [];

                $permissions = Auth::user()->getPermission($projectID);

                if ($project && (isset($permissions) && in_array('show task', $permissions)) || (isset($currentWorkspace) && $currentWorkspace->permission == 'Owner')) {
                    $stages = Stage::where('workspace_id', '=', $currentWorkspace->id)->orderBy('order')->get();
---
select `projects`.* from `projects` inner join `user_projects` on `user_projects`.`project_id` = `projects`.`id` where `user_projects`.`user_id` = 56 and `projects`.`workspace` = 40
select `projects`.* from `projects` inner join `user_projects` on `projects`.`id` = `user_projects`.`project_id` where `user_projects`.`user_id` = 54 and `projects`.`workspace` = 40 and `projects`.`id` = '18' limit 1
select * from `stages` where `workspace_id` = 40 order by `order` asc

                            }
                        }
                        $task->orderBy('order');
                        $status['tasks'] = $task->where('status', '=', $status->id)->get();
---
select * from `tasks` where `project_id` = '18' and `status` = 153 order by `order` asc

    public function taskCreate($slug, $projectID)
    {
        $objUser = Auth::user();
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);
        if ($objUser->getGuard() == 'client') {
            $project = Project::select('projects.*')->where('projects.workspace', '=', $currentWorkspace->id)->where('projects.id', '=', $projectID)->first();
            $projects = Project::select('projects.*')->join('client_projects', 'client_projects.project_id', '=', 'projects.id')->where('client_projects.client_id', '=', $objUser->id)->where('projects.workspace', '=', $currentWorkspace->id)->get();
        } else {
            $project = Project::select('projects.*')->join('user_projects', 'user_projects.project_id', '=', 'projects.id')->where('user_projects.user_id', '=', $objUser->id)->where('projects.workspace', '=', $currentWorkspace->id)->where('projects.id', '=', $projectID)->first();
            $projects = Project::select('projects.*')->join('user_projects', 'user_projects.project_id', '=', 'projects.id')->where('user_projects.user_id', '=', $objUser->id)->where('projects.workspace', '=', $currentWorkspace->id)->get();
        }

        $users = User::select('users.*')->join('user_projects', 'user_projects.user_id', '=', 'users.id')->where('project_id', '=', $projectID)->get();
---
select `projects`.* from `projects` where `projects`.`workspace` = 40 and `projects`.`id` = '18' limit 1
select `users`.* from `users` inner join `user_projects` on `user_projects`.`user_id` = `users`.`id` where `project_id` = '18'
select `projects`.* from `projects` inner join `user_projects` on `user_projects`.`project_id` = `projects`.`id` where `user_projects`.`user_id` = 54 and `projects`.`workspace` = 40 and `projects`.`id` = '18' limit 1

    public function taskOrderUpdate(Request $request, $slug, $projectID)
    {
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);
        $project_name = Project::where('id', $projectID)->first();
        $user1 = $currentWorkspace->id;
        $setting = Utility::getAdminPaymentSettings();
        if (isset($request->sort)) {
            foreach ($request->sort as $index => $taskID) {
                $task = Task::find($taskID);
                $task->order = $index;
                $task->save();
            }
        }

        if ($request->new_status != $request->old_status) {
            $new_status = Stage::find($request->new_status);
            $old_status = Stage::find($request->old_status);
            $user = Auth::user();
            $task = Task::find($request->id);
            $task->status = $request->new_status;
            $task->save();

            $name = $user->name;
            $id = $user->id;

            ActivityLog::create(
                [
                    'user_id' => $id,
                    'user_type' => get_class($user),
                    'project_id' => $projectID,
                    'log_type' => 'Move',
                    'remark' => json_encode(
                        [
                            'title' => $task->title,
                            'old_status' => $old_status->name,
                            'new_status' => $new_status->name,
                        ]
                    ),
                ]
            );
---
select * from `projects` where `id` = '18' limit 1
select * from `tasks` where `tasks`.`id` = '23' limit 1
select * from `stages` where `stages`.`id` = '154' limit 1
select * from `stages` where `stages`.`id` = '153' limit 1
insert into `activity_logs` (`user_id`, `user_type`, `project_id`, `log_type`, `remark`, `updated_at`, `created_at`) values (54, 'App\Models\User', '18', 'Move', '{\"title\":\"sd<gvsd\",\"old_status\":\"Todo\",\"new_status\":\"En curso\"}', '2024-03-15 09:30:38', '2024-03-15 09:30:38')

    public function taskEdit($slug, $projectID, $taskId)
    {
        $objUser = Auth::user();
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);

        if ($objUser->getGuard() == 'client') {
            $project = Project::select('projects.*')->where('projects.workspace', '=', $currentWorkspace->id)->where('projects.id', '=', $projectID)->first();
            $projects = Project::select('projects.*')->join('client_projects', 'client_projects.project_id', '=', 'projects.id')->where('client_projects.client_id', '=', $objUser->id)->where('projects.workspace', '=', $currentWorkspace->id)->get();
        } else {
            $project = Project::select('projects.*')->join('user_projects', 'user_projects.project_id', '=', 'projects.id')->where('user_projects.user_id', '=', $objUser->id)->where('projects.workspace', '=', $currentWorkspace->id)->where('projects.id', '=', $projectID)->first();
            $projects = Project::select('projects.*')->join('user_projects', 'user_projects.project_id', '=', 'projects.id')->where('user_projects.user_id', '=', $objUser->id)->where('projects.workspace', '=', $currentWorkspace->id)->get();
        }
        $users = User::select('users.*')->join('user_projects', 'user_projects.user_id', '=', 'users.id')->where('project_id', '=', $projectID)->get();
        $task = Task::find($taskId);
---
select * from `tasks` where `tasks`.`id` = '37' limit 1

    public function milestone($slug, $projectID)
    {
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);
        $project = Project::find($projectID);
---
select * from `projects` where `projects`.`id` = '18' limit 1

    public function milestoneStore($slug, $projectID, Request $request)
    {
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);
        $project_name = Project::where('id', $projectID)->first();
        $user1 = $currentWorkspace->id;
        $project = Project::find($projectID);
---
select * from `projects` where `id` = '19' limit 1
select * from `projects` where `projects`.`id` = '19' limit 1

                    'task_id',
                ])->toArray();
            } else {
                $timesheets = $timesheets->where('projects.id', $project_id)->get()->groupBy('task_id')->toArray();
---
select * from `projects` where `projects`.`id` = '12' limit 1

    public function copylink_setting_create($slug, $projectID)
    {
        $project = Project::find($projectID);
        if (Auth::user() != null) {
            $objUser         = Auth::user();
        } else {
            $objUser         = User::where('id', $project->created_by)->first();
        }

        $currentWorkspace = Utility::getWorkspaceBySlug($slug);
        $project = Project::select('projects.*')->join('user_projects', 'projects.id', '=', 'user_projects.project_id')->where('user_projects.user_id', '=', $objUser->id)->where('projects.workspace', '=', $currentWorkspace->id)->where('projects.id', '=', $projectID)->first();
---
select `projects`.* from `projects` inner join `user_projects` on `projects`.`id` = `user_projects`.`project_id` where `user_projects`.`user_id` = 22 and `projects`.`workspace` = 20 and `projects`.`id` = '5' limit 1