app/Http/Controllers/ProjectController.php

    public function index($slug)
    {
        /* Cuando actualizamos la columna de ultima actualizacion del proyecto?
            $project = Project::find($project_id);
            $project->updated_at = now(); // Establece `updated_at` a la fecha y hora actuales
            $project->save(); */

        $objUser = Auth::user();
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);

        // Cargamos los proyectos con la relación 'delegation' para evitar N+1 queries
        $projects = Project::with('delegation')
            ->where('projects.workspace', $currentWorkspace->id)
            ->get();
---
select `projects`.* from `projects` where `projects`.`workspace` = 9

    public function userDelete($slug, $project_id, $user_id)
    {
        $objUser = Auth::user();
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);
        $project = Project::select('projects.*')->join('user_projects', 'projects.id', '=', 'user_projects.project_id')
            ->where('user_projects.user_id', '=', $objUser->id)
            ->where(
                'projects.workspace',
                '=',
                $currentWorkspace->id
            )->where('projects.id', '=', $project_id)->first();
        if ($currentWorkspace->permission == 'Owner') {
            if (count($project->user_tasks($user_id)) == 0) {
                UserProject::where('user_id', '=', $user_id)->where('project_id', '=', $project->id)->delete();

                return redirect()->back()->with('success', __('User Deleted Successfully!'));
            } else {
                return redirect()->back()->with('warning', __('Please Remove User From Tasks!'));
            }
        } else {
            return redirect()->route('projects.index', $slug)->with('error', __("You can't Delete Project!"));
---
select * from `projects` where `id` = '18' limit 1

    public function leave($slug, $projectID)
    {
        $objUser = Auth::user();
        $userProject = Project::find($projectID);
---
select * from `projects` where `projects`.`id` = '18' limit 1

    public function taskOrderUpdate(Request $request, $slug, $projectID)
    {
        // dd($request->all());

        $currentWorkspace = Utility::getWorkspaceBySlug($slug);
        $project_name = Project::where('id', $projectID)->first();
        $user1 = $currentWorkspace->id;
        $setting = Utility::getAdminPaymentSettings();
        if (isset($request->sort)) {
            foreach ($request->sort as $index => $taskID) {
                $task = Milestone::find($taskID);
                $task->order = $index;
                $task->save();
            }
        }

        if ($request->new_status != $request->old_status) {
            $new_status = Stage::find($request->new_status);
            $old_status = Stage::find($request->old_status);
            $user = Auth::user();
            $task = Milestone::find($request->id);
---
select * from `milestones` where `milestones`.`id` = '26' limit 1

        $milestone->planned_end_date = $request->planned_end_date;
        $milestone->save();

        $project = Project::where('id', $milestone->project_id)->first();
        if (!$project) {
            return redirect()->back()->with('error', 'Project not found');
---
select * from `projects` where `projects`.`id` in (18)
select * from `projects` where `projects`.`id` in (5)