app/Http/Controllers/UserController.php

select `users`.*, `user_workspaces`.`permission`, `user_workspaces`.`is_active` from `users` inner join `user_workspaces` on `user_workspaces`.`user_id` = `users`.`id` where `user_workspaces`.`workspace_id` = 9 and `type` = 'user'
---
    public function index($slug = '')
    {
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);

        if ($currentWorkspace) {
            //añadido
            $users =  User::where('currant_workspace', '=', $currentWorkspace->id)->where('type', '=', 'user');

            // $users = User::select('users.*', 'user_workspaces.permission', 'user_workspaces.is_active')
            //     ->join('user_workspaces', 'user_workspaces.user_id', '=', 'users.id');
            // $users->where('user_workspaces.workspace_id', '=', $currentWorkspace->id);
            // $users->where('type', 'user')/*->orWhere('type', 'admin') */;
            $users = $users->get();
        } else {
            //añadido
            $users = User::select('users.*')->join('user_workspaces', 'user_workspaces.user_id', '=', 'users.id')
                ->where('user_workspaces.permission', '=', 'Owner')->distinct()->get();