app/Http/Controllers/WorkspaceController.php

select * from `workspaces` where `workspaces`.`id` = '20' limit 1
update `users` set `currant_workspace` = '20', `users`.`updated_at` = '2024-03-05 11:53:20' where `id` = 1
---
    public function changeCurrentWorkspace($workspaceID)
    {
        $objWorkspace = Workspace::find($workspaceID);
        if ($objWorkspace && $objWorkspace->is_active) {
            $currentWorkspace           = Utility::getWorkspaceBySlug($objWorkspace->slug);
            $objUser                    = Auth::user();
            $objUser->currant_workspace = $workspaceID;
            $objUser->save();

select * from `taxes` where `workspace_id` = 1
select * from `stages` where `workspace_id` = 1 order by `order` asc
select * from `bug_stages` where `workspace_id` = 1 order by `order` asc
---
    public function settings($slug)
    {
        $objUser          = Auth::user();
        $currentWorkspace = Utility::getWorkspaceBySlug($slug);

        if ($currentWorkspace && $currentWorkspace->created_by == $objUser->id) {
            $taxes     = Tax::where('workspace_id', '=', $currentWorkspace->id)->get();
            $stages    = Stage::where('workspace_id', '=', $currentWorkspace->id)->orderBy('order')->get();
            $bugStages = BugStage::where('workspace_id', '=', $currentWorkspace->id)->orderBy('order')->get();

select * from `email_templates`
---
                'ffffff',
                '000000',
            ];
            $EmailTemplates = EmailTemplate::all();