app/Models/ActivityLog.php

    public function getRemark()
    {
        $remark = json_decode($this->remark, true);
        if (is_array($remark)) {

            $user = $this->user;
            $user_name = e($user ? $user->name : '');

            if ($this->log_type == 'Upload File') {
                return  $user_name . ' ' . __('Upload new file') . ' <b>' . e($remark['file_name'] ?? '') . '</b>';
            } elseif ($this->log_type == 'Create Timesheet') {
                return $user_name . " " . __('Create new Timesheet');
            } elseif ($this->log_type == 'Create Bug') {
                return $user_name . ' ' . __('Create new Bug') . " <b>" . e($remark['title'] ?? '') . "</b>";
            } elseif ($this->log_type == 'Move Bug') {
                return $user_name . " " . __('Move Bug') . " <b>" . e($remark['title'] ?? '') . "</b> " . __('from') . " " . __(ucwords(e($remark['old_status'] ?? ''))) . " " . __('to') . " " . __(ucwords(e($remark['new_status'] ?? '')));
            } elseif ($this->log_type == 'Invite User') {
                $inviteUser = User::find($remark['user_id']);
---
select * from `users` where `users`.`id` = 1 limit 1