app/Models/Project.php

select count(*) as aggregate from `tasks` where `project_id` = 5
---
    public function countTask()
    {
        return Task::where('project_id', '=', $this->id)->count();

select * from `tasks` where `project_id` = 5 and FIND_IN_SET(1, assign_to)
---
    public function user_tasks($user_id){

        return Task::where('project_id', $this->id)->whereRaw('FIND_IN_SET(?, assign_to)', [$user_id])->get();

select * from `tasks` inner join `stages` on `stages`.`id` = `tasks`.`status` where `project_id` = 5 and `assign_to` = 1 and `stages`.`complete` = '1'
---
    public function user_done_tasks($user_id){
        return Task::join('stages','stages.id','=','tasks.status')->where('project_id','=',$this->id)->where('assign_to','=',$user_id)->where('stages.complete','=','1')->get();

select count(*) as aggregate from `tasks` inner join `comments` on `comments`.`task_id` = `tasks`.`id` where `project_id` = 5
---
    public function countTaskComments()
    {
        return Task::join('comments', 'comments.task_id', '=', 'tasks.id')->where('project_id', '=', $this->id)->count();

select * from `projects` where `projects`.`id` = '-1' limit 1
select * from `user_workspaces` where `user_id` = 1 and `workspace_id` = 20 limit 1
---
    public static function getProjectAssignedTimesheetHTML($currentWorkspace, $timesheets = [], $days = [], $project_id = null, $seeAsOwner = false)
    {
        $project = Project::find($project_id);

        if (Auth::user() != null) {
            $objUser         = Auth::user();
        } else {
            $objUser         = User::where('id', $currentWorkspace->created_by)->first();
        }

        if ($objUser->getGuard() != 'client') {

            $permission =  UserWorkspace::where('user_id', $objUser->id)->where('workspace_id', $objUser->currant_workspace)->first()->permission;

select * from `projects` where `projects`.`id` = 5 limit 1
---
                $project_timesheets = Timesheet::select('timesheets.*')->join('projects', 'projects.id', '=', 'timesheets.project_id')->join('tasks', 'timesheets.task_id', '=', 'tasks.id')->where('projects.workspace', '=', $currentWorkspace->id)->whereRaw("find_in_set('" . $user_id . "',tasks.assign_to)");
            }
            foreach ($timesheets as $project_id => $timesheet) {
                $project = Project::find($project_id);

select * from `tasks` where `tasks`.`id` = 4 limit 1
---
                    $timesheetArray[$k]['project_id']   = $project->id;
                    $timesheetArray[$k]['project_name'] = $project->name;
                    foreach ($timesheet as $task_id => $tasktimesheet) {
                        $task = Task::find($task_id);

select * from `users` where `users`.`id` in (1)
---

                            // $users = $new_projects_timesheet->where('timesheets.task_id', $task->id)->pluck('created_by')->toArray();

                            $users = $new_projects_timesheet->where('timesheets.task_id', $task->id)->groupBy('timesheets.created_by')->with('getUser')->get();