app/Models/Project.php

    public function countTaskComments()
    {
        return Task::join('comments', 'comments.task_id', '=', 'tasks.id')->where('project_id', '=', $this->id)->count();
---
select count(*) as aggregate from `tasks` inner join `comments` on `comments`.`task_id` = `tasks`.`id` where `project_id` = 9