app/Models/Stage.php

select `stages`.`id`, count(tasks.id) as task_count from `stages` left join `tasks` on `stages`.`id` = `tasks`.`project_id` where `stages`.`workspace_id` = 20 and date(`tasks`.`updated_at`) = '2024-02-26' and `tasks`.`project_id` = '5' group by `stages`.`id`
---
    public static function getTaskCountsForDate($workspaceId, $projectId, $date)
    // public static function getMilestoneCountsForDate($workspaceId, $projectId, $date)
    {
        return static::leftJoin('milestones', 'stages.id', '=', 'milestones.project_id')
            ->where('stages.workspace_id', $workspaceId)
            ->whereDate('milestones.updated_at', $date)
            ->when($projectId !== null, function ($query) use ($projectId) {
                return $query->where('milestones.project_id', $projectId);
            })
            ->groupBy('stages.id')
            ->select('stages.id', \DB::raw('count(milestones.id) as milestones_count'))
            ->get()
            ->pluck('milestones_count', 'id')
            ->toArray();