app/Models/Task.php

select * from `users` where `id` in ('54', '56')
---
    public function users()
    {
        return User::whereIn('id', explode(',', $this->assign_to))->get();

select * from `users` where `id` in ('54', '56')
---
    public function taskUsers()
    {
        // User::select('users.*')->join('projects','projects.workspace', '=', 'users.currant_workspace');
        return User::whereIn('id', explode(',', $this->assign_to))->get();

select * from `milestones` where `milestones`.`id` = '26' limit 1
---
    public function milestone()
    {
        return $this->milestone_id ? Milestone::find($this->milestone_id) : null;

select * from `sub_tasks` where `sub_tasks`.`task_id` = 37 and `sub_tasks`.`task_id` is not null order by `id` desc
---
    public function sub_tasks()
    {
        return $this->hasMany('App\Models\SubTask', 'task_id', 'id')->orderBy('id', 'DESC');