app/Models/User.php

        public function countProject($workspace_id = '')
        {
                $count = UserProject::join('projects', 'projects.id', '=', 'user_projects.project_id')->where('user_projects.user_id', '=', $this->id);
                if (!empty($workspace_id)) {
                        $count->where('projects.workspace', '=', $workspace_id);
                }

                return $count->count();
---
select count(*) as aggregate from `user_projects` inner join `projects` on `projects`.`id` = `user_projects`.`project_id` where `user_projects`.`user_id` = 56 and `projects`.`workspace` = 40

        public function countWorkspace()
        {
                return Workspace::where('created_by', '=', $this->id)->count();
---
select count(*) as aggregate from `workspaces` where `created_by` = 56

        public function countUsers($workspace_id)
        {
                $count = UserWorkspace::join('workspaces', 'workspaces.id', '=', 'user_workspaces.workspace_id');
                if (!empty($workspace_id)) {
                        $count->where('workspaces.id', '=', $workspace_id);
                } else {
                        $count->whereIn('workspaces.id', function ($query) {
                                $query->select('workspace_id')->from('user_workspaces')->where('permission', '=', 'Owner')->where('user_id', '=', $this->id);
                        });
                }

                return $count->count();
---
select count(*) as aggregate from `user_workspaces` inner join `workspaces` on `workspaces`.`id` = `user_workspaces`.`workspace_id` where `workspaces`.`id` = 40

        public function countClients($workspace_id)
        {
                $count = ClientWorkspace::join('workspaces', 'workspaces.id', '=', 'client_workspaces.workspace_id');
                if (!empty($workspace_id)) {
                        $count->where('workspaces.id', '=', $workspace_id);
                } else {
                        $count->whereIn('workspaces.id', function ($query) {
                                $query->select('workspace_id')->from('user_workspaces')->where('permission', '=', 'Owner')->where('user_id', '=', $this->id);
                        });
                }

                return $count->count();
---
select count(*) as aggregate from `client_workspaces` inner join `workspaces` on `workspaces`.`id` = `client_workspaces`.`workspace_id` where `workspaces`.`id` = 40

        public function notifications($workspace_id)
        {
                return Notification::select('notifications.*')
                        ->with(['user', 'project', 'task', 'bugReport'])
                        ->leftJoin('projects', function ($join) {
                                $join->on('notifications.related_id', '=', 'projects.id')
                                        ->where('notifications.type', 'project_assign');
                        })
                        ->leftJoin('tasks', function ($join) {
                                $join->on('notifications.related_id', '=', 'tasks.id')
                                        ->where('notifications.type', 'task_assign');
                        })
                        ->leftJoin('bug_reports', function ($join) {
                                $join->on('notifications.related_id', '=', 'bug_reports.id')
                                        ->where('notifications.type', 'bug_assign');
                        })
                        ->where('user_id', $this->id)
                        ->where('workspace_id', $workspace_id)
                        ->where('is_read', 0)
                        ->orderBy('notifications.id', 'desc')
                        ->get();
---
select * from `bug_reports` where `bug_reports`.`id` in (13, 14, 15, 16)
select * from `projects` where `projects`.`id` in (12, 13)
select * from `tasks` where `tasks`.`id` in (13, 14, 15, 16)
select * from `users` where `users`.`id` in (4)

        public function getPermission($project_id)
        {
                //========================================MODIFICADO ===========================================================//
                $data = UserProject::where('user_id', '=', $this->id)->where('project_id', '=', $project_id)->first();
---
select * from `user_projects` where `user_id` = 58 and `project_id` = 20 limit 1