app/Models/Workspace.php

select * from `user_workspaces` where `workspace_id` = 40 and `permission` = 'Owner' limit 1
---
    public function owner($id)
    {
        $owner1 = UserWorkspace::where('workspace_id', $id)->where('permission', 'Owner')->first();

select `users`.*, `user_workspaces`.`workspace_id` as `pivot_workspace_id`, `user_workspaces`.`user_id` as `pivot_user_id`, `user_workspaces`.`is_active` as `pivot_is_active` from `users` inner join `user_workspaces` on `users`.`id` = `user_workspaces`.`user_id` where `user_workspaces`.`workspace_id` = 20 and `users`.`id` != 22
---
    public function users($created_by = false)
    {
        if ($created_by) {
            return $this->belongsToMany('App\Models\User', 'user_workspaces', 'workspace_id', 'user_id')->withPivot('is_active')->where('users.id', "!=", $created_by)->get();